AUTO_config_TK_pesok/src/InformationRegisters/ТК_АктивныеЗапросыНаОтборРезерваТСД/ТК_АктивныеЗапросыНаОтборРезерваТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_АктивныеЗапросыНаОтборРезерваТСД</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <type>
      <types>DocumentRef.РезервированиеЗаказовПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_АктивныеЗапросыНаОтборРезерваТСД/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
#Область ПрограммныйИнтерфейс


#Область ДляВызоваИзДругихПодсистем



Процедура УстановитьОтборРезерва(ТорговаяПлощадка,Резерв,Пользователь)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ТК_АктивныеЗапросыНаОтборРезерваТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТорговаяПлощадка.Установить(ТорговаяПлощадка);
	нЗапись = НаборЗаписей.Добавить();
	нЗапись.ТорговаяПлощадка = ТорговаяПлощадка;
	нЗапись.Резерв = Резерв;
	нЗапись.Пользователь = Пользователь;
	нЗапись.Дата = ТекущаяДатаСеанса();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры




#КонецОбласти
	
#КонецОбласти

	
#КонецЕсли
